<a href="https://colab.research.google.com/github/frank-morales2020/MLxDL/blob/main/Evaluator_ChromaDB_Post_Trainining_synthetic_text_to_sql_gretelai.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
!pip install -q datasets
!pip install -q chromadb
!pip install -q faiss-gpu
!pip install peft  -q

!pip install bitsandbytes -q
!pip pip install accelerate -q

!pip install -U flash-attn --no-build-isolation --quiet

!pip install colab-env --quiet

!pip install mistral_inference -q

!pip install -q evaluate sentence_transformers

In [2]:
!nvidia-smi

Sun Jul  7 17:54:26 2024
+---------------------------------------------------------------------------------------+
| NVIDIA-SMI 535.104.05             Driver Version: 535.104.05   CUDA Version: 12.2     |
|-----------------------------------------+----------------------+----------------------+
| GPU  Name                 Persistence-M | Bus-Id        Disp.A | Volatile Uncorr. ECC |
| Fan  Temp   Perf          Pwr:Usage/Cap |         Memory-Usage | GPU-Util  Compute M. |
|                                         |                      |               MIG M. |
|=========================================+======================+======================|
|   0  NVIDIA L4                      Off | 00000000:00:03.0 Off |                    0 |
| N/A   37C    P8              16W /  72W |      1MiB / 23034MiB |      0%      Default |
|                                         |                      |                  N/A |
+-----------------------------------------+----------------------+----------------------+

+---------------------------------------------------------------------------------------+
| Processes:                                                                            |
|  GPU   GI   CI        PID   Type   Process name                            GPU Memory |
|        ID   ID                                                             Usage      |
|=======================================================================================|
|  No running processes found                                                           |
+---------------------------------------------------------------------------------------+

In [ ]:
import torch
import colab_env
import os
import sys
import json
import IPython
from datetime import datetime
from datasets import load_dataset
from peft import LoraConfig, PeftModel, prepare_model_for_kbit_training, get_peft_model
from transformers import (
    AutoModelForCausalLM,
    AutoTokenizer,
    BitsAndBytesConfig,
    AutoTokenizer,
    TrainingArguments,
)

# Environment Settings

In [ ]:
import logging
from tqdm.auto import tqdm
from datasets import load_dataset
from peft import AutoPeftModelForCausalLM
from transformers import AutoTokenizer, pipeline
import os


from sentence_transformers import SentenceTransformer
import chromadb

# Logging Setup
logging.basicConfig(level=logging.INFO)

# 1. Configurable Parameters
PEFT_MODEL_ID = "frankmorales2020/Mistral-7B-text-to-sql-flash-attention-2-dataeval"

#b-mc2/sql-create-context
#DATASET_FILE = "/content/drive/MyDrive/datasets/test_dataset.json"

#gretelai/synthetic_text_to_sql
DATASET_FILE = "/content/drive/MyDrive/datasets/gretelai_test_dataset.json"


NUM_SAMPLES_TO_PROCESS = int(os.getenv("NUM_SAMPLES", 100))
GENERATION_PARAMS = {
    "max_new_tokens": 256, "do_sample": True, "temperature": 0.7, "top_k": 50, "top_p": 0.95
}
SIMILARITY_THRESHOLD = 0.75

# 2. Mount Google Drive (for Colab)
from google.colab import drive
drive.mount('/content/drive')

# 3. Load Evaluation Dataset
eval_dataset = load_dataset("json", data_files=DATASET_FILE, split="train")
if NUM_SAMPLES_TO_PROCESS > 0:
    eval_dataset = eval_dataset.select(range(NUM_SAMPLES_TO_PROCESS))
logging.info(f"Processing {len(eval_dataset)} samples from the dataset.")


# 4. Load Models and Tokenizer
logging.info(f"Loading fine-tuned PEFT model from: {PEFT_MODEL_ID}")
model = AutoPeftModelForCausalLM.from_pretrained(PEFT_MODEL_ID)
tokenizer = AutoTokenizer.from_pretrained(PEFT_MODEL_ID)
pipe = pipeline("text-generation", model=model, tokenizer=tokenizer, **GENERATION_PARAMS)
logging.info("Model and tokenizer loaded successfully!")

# 5. ChromaDB Setup
client = chromadb.PersistentClient(path='db')  # Store embeddings on disk
collection = client.get_or_create_collection(name="sql_queries_and_embeddings")

# Add Original SQL Queries to ChromaDB
embedding_model = SentenceTransformer("all-mpnet-base-v2")
original_sql_queries = [
    item['messages'][2]['content']
    for item in eval_dataset if len(item['messages']) > 2 and item['messages'][2].get('content')
]

sql_embeddings = embedding_model.encode(original_sql_queries).tolist()
collection.add(
    embeddings=sql_embeddings,
    metadatas=[{"original_sql": query} for query in original_sql_queries],
    ids=[f"original_{i}" for i in range(len(original_sql_queries))]  # Unique IDs
)

# Postgresql Setup

In [ ]:
#ADDED By FM 01/06/2024
!apt-get update -y
!apt-get install postgresql-14 -y

!service postgresql restart
!sudo apt install postgresql-server-dev-all

In [6]:
# PostGRES SQL Settings
!sudo -u postgres psql -c "CREATE USER postgres WITH SUPERUSER"
!sudo -u postgres psql -c "ALTER USER postgres PASSWORD 'postgres'"

ERROR:  role "postgres" already exists
ALTER ROLE

In [7]:
QUERY_create='CREATE TABLE table_name_24 (score VARCHAR, date VARCHAR)'

In [8]:
QUERY_select='SELECT 2009 FROM table_name_50 WHERE 2011 = "a"'

In [9]:
def table_creator(query):
    import os
    import psycopg2 as ps
    import pandas as pd

    DB_NAME = "postgres"
    DB_USER = "postgres"
    DB_PASS = "postgres"
    DB_HOST = "localhost"
    DB_PORT = "5432"

    conn = ps.connect(database=DB_NAME,
                  user=DB_USER,
                  password=DB_PASS,
                  host=DB_HOST,
                  port=DB_PORT)

    cur = conn.cursor() # creating a cursor




    # Wrap the execute command in a try-except block to handle potential errors
    try:
        cur.execute("""
                            %s
                            """%query)
        conn.commit()
        print("Table Created successfully")
    except Exception as e:
        conn.rollback() # Rollback the transaction in case of an error
        print("Error creating table:", e)

    conn.close()

In [10]:
import os
import psycopg2 as ps
import pandas as pd

DB_NAME = "postgres"
DB_USER = "postgres"
DB_PASS = "postgres"
DB_HOST = "localhost"
DB_PORT = "5432"

In [11]:
import os
import psycopg2 as ps
import pandas as pd

def table_select(query):
    conn = ps.connect(database=DB_NAME,
                      user=DB_USER,
                      password=DB_PASS,
                      host=DB_HOST,
                      port=DB_PORT)
    print("Database connected successfully")

    #query = query.replace('"', "'") # Replace double quotes with single quotes for potential date values

    try:

        #df = pd.read_sql_query("%s"%query, con=conn)
        #print('rec: %'%df) # Print the resulting DataFrame

        cur = conn.cursor()
        cur.execute(query)
        rows = cur.fetchall()
        conn.commit()
        conn.close()
        print('\n')
        print('Record(s): %s \n'%len(rows))
        for row in rows:
            print(row)


        eqc=1

    except Exception as e:
        eqc=0
        #conn.rollback() # Rollback the transaction in case of an error
        print("Error executing query:", e)
        #print('TABLE IS EMPTY')
        conn.commit()
        conn.close()

    return eqc

In [12]:
table_creator(QUERY_create)

Table Created successfully

# Model Evaluator

In [13]:
# 6. Evaluation Function (Exact Match Only)
def evaluate(sample):
    eqc=0
    prompt = pipe.tokenizer.apply_chat_template(sample["messages"][:2], tokenize=False, add_generation_prompt=True)
    outputs = pipe(prompt, max_new_tokens=256, do_sample=True, temperature=0.7, top_k=50, top_p=0.95, eos_token_id=pipe.tokenizer.eos_token_id, pad_token_id=pipe.tokenizer.pad_token_id)
    predicted_answer = outputs[0]['generated_text'][len(prompt):].strip()

    #print("\n\n")
    question = sample["messages"][1]["content"]
    original_answer = sample["messages"][2]["content"]


    schema=sample["messages"][0]['content']
    schema_query=schema[153:len(schema)]

    print(f'Question: {question}')
    print(f'SCHEMA: {schema_query}')
    print(f'Original Answer: {original_answer}')
    print(f'Generated Answer: {predicted_answer}')

    if predicted_answer == original_answer:

        print("\n")
        print(f'SCHEMA QUERY: {schema_query}')
        table_creator(schema_query)
        print("\n")
        print(f'Generated Answer: {predicted_answer}')
        eqc=table_select(predicted_answer)
        print(eqc)
        print("\n")
        if int(eqc)==1:
           print('Good Query execution')
        else:
           print('Bad Query execution')

        print("\n")
        print('MATCH')
        return 1, eqc

    # If not an exact match, check semantic similarity using ChromaDB:
    predicted_embedding = embedding_model.encode([predicted_answer]).tolist()[0]
    results = collection.query(
        query_embeddings=[predicted_embedding],
        n_results=1,
        include=["distances", "metadatas"]
    )
    closest_distance = results['distances'][0][0]
    most_similar_query = results['metadatas'][0][0]['original_sql']
    print(f'Closest Distance: {closest_distance}')

    similarity_threshold = SIMILARITY_THRESHOLD

    if closest_distance < similarity_threshold:
        print("\n")
        print('MATCH (Semantically Similar)')
        print("\n")
        print(f'SCHEMA QUERY: {schema_query}')
        table_creator(schema_query)
        print("\n")
        print('Similar Query:', most_similar_query)
        eqc=table_select(most_similar_query)
        print("\n")
        if int(eqc)==1:
           print('Good Query execution')
        else:
           print('Bad Query execution')
        print("\n")
        return 1, eqc

    else:
        print('NO MATCH')
        return 0, eqc

    print("\n\n")

# 7. Main Evaluation Loop
success_rate = []
success_rate_query = []

for i, s in enumerate(tqdm(eval_dataset)):
    print()
    print(f"Evaluating sample: {i}")
    try:
        success_rate.append(evaluate(s))
    except Exception as e:
        logging.error(f"Error evaluating sample {i}: {e}")



# 8. Compute and Print Accuracy
if len(success_rate) > 0:
    # Extract the first element (match success indicator) from each tuple
    match_successes = [result[0] for result in success_rate]
    accuracy = sum(match_successes) / len(success_rate)
    print(f"\nMatch Accuracy: {accuracy:.2%}\n")

    query_successes = [result[1] for result in success_rate]
    accuracy = sum(query_successes) / len(query_successes)
    print(f"\nQuery Successes: {accuracy:.2%}\n")

else:
    print("\nNo samples were successfully evaluated. Check the dataset and evaluation logic.\n")


# 8. Compute and Print Accuracy
#if len(success_rate) > 0:
#    accuracy = sum(success_rate) / len(success_rate)
#    print(f"\nMatch Accuracy: {accuracy:.2%}\n")
#else:
#    print("\nNo samples were successfully evaluated. Check the dataset and evaluation logic.\n")

  0%|          | 0/100 [00:00<?, ?it/s]

Evaluating sample: 0
Question: What is the percentage of successful open data initiatives in the education sector?
SCHEMA: CREATE TABLE open_data_initiatives (id INT, sector VARCHAR(20), status VARCHAR(10)); INSERT INTO open_data_initiatives (id, sector, status) VALUES (1, 'justice', 'open'), (2, 'transportation', 'open'), (3, 'education', 'closed'), (4, 'education', 'open');
Original Answer: SELECT 100.0 * COUNT(CASE WHEN status = 'open' THEN 1 END) / COUNT(*) FROM open_data_initiatives WHERE sector = 'education';
Generated Answer: SELECT COUNT(*) FROM open_data_initiatives WHERE sector = 'education' AND status = 'open' / SELECT COUNT(*) FROM open_data_initiatives WHERE sector = 'education'
Closest Distance: 0.3737031817436218


MATCH (Semantically Similar)


SCHEMA QUERY: CREATE TABLE open_data_initiatives (id INT, sector VARCHAR(20), status VARCHAR(10)); INSERT INTO open_data_initiatives (id, sector, status) VALUES (1, 'justice', 'open'), (2, 'transportation', 'open'), (3, 'education', 'closed'), (4, 'education', 'open');
Table Created successfully


Similar Query: SELECT 100.0 * COUNT(CASE WHEN status = 'open' THEN 1 END) / COUNT(*) FROM open_data_initiatives WHERE sector = 'education';
Database connected successfully


Record(s): 1

(Decimal('50.0000000000000000'),)


Good Query execution



Evaluating sample: 1
Question: What is the average Shariah-compliant investment portfolio return for female investors in the Middle East, grouped by year?
SCHEMA: CREATE TABLE Investments (Id INT, InvestorGender VARCHAR(10), Location VARCHAR(20), InvestmentType VARCHAR(20), Return DECIMAL(5,2), InvestmentYear INT); INSERT INTO Investments (Id, InvestorGender, Location, InvestmentType, Return, InvestmentYear) VALUES (1, 'Female', 'Middle East', 'Shariah Compliant', 8.56, 2020), (2, 'Female', 'Middle East', 'Shariah Compliant', 9.15, 2021);
Original Answer: SELECT AVG(Return) AS Avg_Return, InvestmentYear FROM Investments WHERE InvestmentType = 'Shariah Compliant' AND InvestorGender = 'Female' GROUP BY InvestmentYear;
Generated Answer: SELECT AVG(Return), InvestmentYear FROM Investments WHERE InvestorGender = 'Female' AND Location = 'Middle East' AND InvestmentType = 'Shariah Compliant' GROUP BY InvestmentYear
Closest Distance: 0.09634736180305481


MATCH (Semantically Similar)


SCHEMA QUERY: CREATE TABLE Investments (Id INT, InvestorGender VARCHAR(10), Location VARCHAR(20), InvestmentType VARCHAR(20), Return DECIMAL(5,2), InvestmentYear INT); INSERT INTO Investments (Id, InvestorGender, Location, InvestmentType, Return, InvestmentYear) VALUES (1, 'Female', 'Middle East', 'Shariah Compliant', 8.56, 2020), (2, 'Female', 'Middle East', 'Shariah Compliant', 9.15, 2021);
Table Created successfully


Similar Query: SELECT AVG(Return) AS Avg_Return, InvestmentYear FROM Investments WHERE InvestmentType = 'Shariah Compliant' AND InvestorGender = 'Female' GROUP BY InvestmentYear;
Database connected successfully


Record(s): 2

(Decimal('8.5600000000000000'), 2020)
(Decimal('9.1500000000000000'), 2021)


Good Query execution



Evaluating sample: 2
Question: Find the minimum founding year for startups founded by Indigenous or Native entrepreneurs
SCHEMA: CREATE TABLE company (id INT, name TEXT, founding_year INT, founder_race TEXT); INSERT INTO company (id, name, founding_year, founder_race) VALUES (1, 'IndigenousTech', 2010, 'Indigenous or Native American'); INSERT INTO company (id, name, founding_year, founder_race) VALUES (2, 'Beta', 2015, 'White');
Original Answer: SELECT MIN(founding_year) FROM company WHERE founder_race = 'Indigenous or Native American';
Generated Answer: SELECT MIN(founding_year) FROM company WHERE founder_race = 'Indigenous or Native American'
Closest Distance: 0.0234964732080698


MATCH (Semantically Similar)


SCHEMA QUERY: CREATE TABLE company (id INT, name TEXT, founding_year INT, founder_race TEXT); INSERT INTO company (id, name, founding_year, founder_race) VALUES (1, 'IndigenousTech', 2010, 'Indigenous or Native American'); INSERT INTO company (id, name, founding_year, founder_race) VALUES (2, 'Beta', 2015, 'White');
Table Created successfully


Similar Query: SELECT MIN(founding_year) FROM company WHERE founder_race = 'Indigenous or Native American';
Database connected successfully


Record(s): 1

(2010,)


Good Query execution



Evaluating sample: 3
Question: How many intelligence operations were conducted in 'Africa' in the 'IntelligenceOperations' table?
SCHEMA: CREATE TABLE IntelligenceOperations (id INT PRIMARY KEY, operation_name VARCHAR(100), location VARCHAR(50), operation_type VARCHAR(50), start_date DATE, end_date DATE); INSERT INTO IntelligenceOperations (id, operation_name, location, operation_type, start_date, end_date) VALUES (1, 'Operation Red Anvil', 'Africa', 'Surveillance', '2021-01-01', '2021-03-31'); INSERT INTO IntelligenceOperations (id, operation_name, location, operation_type, start_date, end_date) VALUES (2, 'Operation Night Hawk', 'Europe', 'Counterintelligence', '2021-04-01', '2021-06-30');
Original Answer: SELECT COUNT(*) FROM IntelligenceOperations WHERE location = 'Africa';
Generated Answer: SELECT COUNT(*) FROM IntelligenceOperations WHERE location = "Africa" AND operation_type = "Surveillance" AND start_date <= 2021 AND end_date <= 2021
Closest Distance: 0.34414035081863403


MATCH (Semantically Similar)


SCHEMA QUERY: CREATE TABLE IntelligenceOperations (id INT PRIMARY KEY, operation_name VARCHAR(100), location VARCHAR(50), operation_type VARCHAR(50), start_date DATE, end_date DATE); INSERT INTO IntelligenceOperations (id, operation_name, location, operation_type, start_date, end_date) VALUES (1, 'Operation Red Anvil', 'Africa', 'Surveillance', '2021-01-01', '2021-03-31'); INSERT INTO IntelligenceOperations (id, operation_name, location, operation_type, start_date, end_date) VALUES (2, 'Operation Night Hawk', 'Europe', 'Counterintelligence', '2021-04-01', '2021-06-30');
Table Created successfully


Similar Query: SELECT COUNT(*) FROM IntelligenceOperations WHERE location = 'Africa';
Database connected successfully


Record(s): 1

(1,)


Good Query execution



Evaluating sample: 4
Question: What is the total number of space missions led by women?
SCHEMA: CREATE TABLE space_missions (id INT, name VARCHAR(255), leader VARCHAR(255), year INT); INSERT INTO space_missions (id, name, leader, year) VALUES (1, 'Mars Rover', 'Dr. Jessica Watkins', 2022); INSERT INTO space_missions (id, name, leader, year) VALUES (2, 'ISS Expedition', 'Anousheh Ansari', 2023);
Original Answer: SELECT COUNT(*) FROM space_missions WHERE leader IN (SELECT name FROM astronauts WHERE gender = 'Female');
Generated Answer: SELECT COUNT(*) FROM space_missions WHERE leader = 'Anousheh Ansari' AND year > 2022
Closest Distance: 0.5059126615524292


MATCH (Semantically Similar)


SCHEMA QUERY: CREATE TABLE space_missions (id INT, name VARCHAR(255), leader VARCHAR(255), year INT); INSERT INTO space_missions (id, name, leader, year) VALUES (1, 'Mars Rover', 'Dr. Jessica Watkins', 2022); INSERT INTO space_missions (id, name, leader, year) VALUES (2, 'ISS Expedition', 'Anousheh Ansari', 2023);
Table Created successfully


Similar Query: SELECT COUNT(*) FROM space_missions WHERE leader IN (SELECT name FROM astronauts WHERE gender = 'Female');
Database connected successfully
Error executing query: relation "astronauts" does not exist
LINE 1: ... space_missions WHERE leader IN (SELECT name FROM astronauts...
                                                             ^



Bad Query execution



Evaluating sample: 5
Question: How many products are sold by each supplier?
SCHEMA: CREATE TABLE Products (ProductID int, SupplierID int, QuantitySold int);
Original Answer: SELECT SupplierID, SUM(QuantitySold) FROM Products GROUP BY SupplierID;
Generated Answer: SELECT COUNT(*), SupplierID FROM Products GROUP BY SupplierID
Closest Distance: 0.18182766437530518


MATCH (Semantically Similar)


SCHEMA QUERY: CREATE TABLE Products (ProductID int, SupplierID int, QuantitySold int);
Table Created successfully


Similar Query: SELECT supplier_id, COUNT(DISTINCT id) FROM products GROUP BY supplier_id;
Database connected successfully
Error executing query: column "supplier_id" does not exist
LINE 1: SELECT supplier_id, COUNT(DISTINCT id) FROM products GROUP B...
               ^
HINT:  Perhaps you meant to reference the column "products.supplierid".



Bad Query execution



Evaluating sample: 6
Question: What is the total waste generation in kg for the top 3 countries in 2020?
SCHEMA: CREATE TABLE waste_generation (country VARCHAR(255), year INT, amount FLOAT); INSERT INTO waste_generation (country, year, amount) VALUES ('USA', 2020, 500.0), ('Canada', 2020, 350.0), ('Mexico', 2020, 400.0);
Original Answer: SELECT wg.country, SUM(wg.amount) as total_waste FROM waste_generation wg WHERE wg.year = 2020 AND wg.country IN ('USA', 'Canada', 'Mexico') GROUP BY wg.country ORDER BY total_waste DESC LIMIT 3;
Generated Answer: SELECT SUM(amount) FROM waste_generation WHERE country IN ('USA', 'Canada', 'Mexico') AND year = 2020
Closest Distance: 0.2812768220901489


MATCH (Semantically Similar)


SCHEMA QUERY: CREATE TABLE waste_generation (country VARCHAR(255), year INT, amount FLOAT); INSERT INTO waste_generation (country, year, amount) VALUES ('USA', 2020, 500.0), ('Canada', 2020, 350.0), ('Mexico', 2020, 400.0);
Table Created successfully


Similar Query: SELECT wg.country, SUM(wg.amount) as total_waste FROM waste_generation wg WHERE wg.year = 2020 AND wg.country IN ('USA', 'Canada', 'Mexico') GROUP BY wg.country ORDER BY total_waste DESC LIMIT 3;
Database connected successfully


Record(s): 3

('USA', 500.0)
('Mexico', 400.0)
('Canada', 350.0)


Good Query execution



Evaluating sample: 7
Question: What is the average age of attendees at arts events in California and how many unique events have there been?
SCHEMA: CREATE TABLE ca_events (id INT, num_attendees INT, avg_age FLOAT); CREATE TABLE ca_event_types (id INT, event_type VARCHAR(15)); INSERT INTO ca_events (id, num_attendees, avg_age) VALUES (1, 1200, 35.5), (2, 1800, 40.2); INSERT INTO ca_event_types (id, event_type) VALUES (1, 'Dance'), (2, 'Music');
Original Answer: SELECT AVG(ce.avg_age), COUNT(DISTINCT cet.event_type) FROM ca_events ce INNER JOIN ca_event_types cet ON TRUE;
Generated Answer: SELECT AVG(t2.avg_age) FROM ca_events AS t1 JOIN ca_event_types AS t2 ON t1.event_type = t2.id WHERE t2.event_type = "Dance" OR t2.event_type = "Music"
Closest Distance: 0.4498296082019806


MATCH (Semantically Similar)


SCHEMA QUERY: CREATE TABLE ca_events (id INT, num_attendees INT, avg_age FLOAT); CREATE TABLE ca_event_types (id INT, event_type VARCHAR(15)); INSERT INTO ca_events (id, num_attendees, avg_age) VALUES (1, 1200, 35.5), (2, 1800, 40.2); INSERT INTO ca_event_types (id, event_type) VALUES (1, 'Dance'), (2, 'Music');
Table Created successfully


Similar Query: SELECT AVG(ce.avg_age), COUNT(DISTINCT cet.event_type) FROM ca_events ce INNER JOIN ca_event_types cet ON TRUE;
Database connected successfully


Record(s): 1

(37.85, 2)


Good Query execution



Evaluating sample: 8
Question: Find the average waste generation for chemicals with a carbon footprint above 800.
SCHEMA: CREATE TABLE waste_generation (id INT PRIMARY KEY, chemical_id INT, waste_generation INT); INSERT INTO waste_generation (id, chemical_id, waste_generation) VALUES (1, 1, 900); CREATE TABLE environmental_impact (id INT PRIMARY KEY, chemical_id INT, carbon_footprint INT); INSERT INTO environmental_impact (id, chemical_id, carbon_footprint) VALUES (1, 1, 850);
Original Answer: SELECT AVG(waste_generation) FROM waste_generation wg JOIN environmental_impact ei ON wg.chemical_id = ei.chemical_id WHERE ei.carbon_footprint > 800;
Generated Answer: SELECT AVG(w.generation) FROM waste_generation AS w JOIN environmental_impact AS e ON w.chemical_id = e.chemical_id WHERE e.carbon_footprint > 800
Closest Distance: 0.03243521973490715


MATCH (Semantically Similar)


SCHEMA QUERY: CREATE TABLE waste_generation (id INT PRIMARY KEY, chemical_id INT, waste_generation INT); INSERT INTO waste_generation (id, chemical_id, waste_generation) VALUES (1, 1, 900); CREATE TABLE environmental_impact (id INT PRIMARY KEY, chemical_id INT, carbon_footprint INT); INSERT INTO environmental_impact (id, chemical_id, carbon_footprint) VALUES (1, 1, 850);
Error creating table: relation "waste_generation" already exists



Similar Query: SELECT AVG(waste_generation) FROM waste_generation wg JOIN environmental_impact ei ON wg.chemical_id = ei.chemical_id WHERE ei.carbon_footprint > 800;
Database connected successfully
Error executing query: relation "environmental_impact" does not exist
LINE 1: ...G(waste_generation) FROM waste_generation wg JOIN environmen...
                                                             ^



Bad Query execution



Evaluating sample: 9
Question: How many TV shows have the word 'News' in their title?
SCHEMA: CREATE TABLE shows (id INT, title TEXT, genre TEXT); INSERT INTO shows (id, title, genre) VALUES (1, 'News Show1', 'News'), (2, 'Entertainment Show2', 'Entertainment'), (3, 'Breaking News Show3', 'News');
Original Answer: SELECT COUNT(*) FROM shows WHERE title LIKE '%News%';
Generated Answer: SELECT COUNT(*) FROM shows WHERE genre = 'News'
Closest Distance: 0.4847338795661926


MATCH (Semantically Similar)


SCHEMA QUERY: CREATE TABLE shows (id INT, title TEXT, genre TEXT); INSERT INTO shows (id, title, genre) VALUES (1, 'News Show1', 'News'), (2, 'Entertainment Show2', 'Entertainment'), (3, 'Breaking News Show3', 'News');
Table Created successfully


Similar Query: SELECT COUNT(*) FROM shows WHERE title LIKE '%News%';
Database connected successfully


Record(s): 1

(2,)


Good Query execution



Evaluating sample: 10
Question: What was the total energy consumption (in MWh) for residential buildings in California in 2020?
SCHEMA: CREATE TABLE residential_energy_consumption (state VARCHAR(20), year INT, sector VARCHAR(20), energy_consumption FLOAT);
Original Answer: SELECT SUM(energy_consumption) FROM residential_energy_consumption WHERE state = 'California' AND year = 2020 AND sector = 'Residential';
Generated Answer: SELECT SUM(energy_consumption) FROM residential_energy_consumption WHERE state = "California" AND sector = "residential" AND year = 2020
Closest Distance: 0.0150598818436265


MATCH (Semantically Similar)


SCHEMA QUERY: CREATE TABLE residential_energy_consumption (state VARCHAR(20), year INT, sector VARCHAR(20), energy_consumption FLOAT);
Table Created successfully


Similar Query: SELECT SUM(energy_consumption) FROM residential_energy_consumption WHERE state = 'California' AND year = 2020 AND sector = 'Residential';
Database connected successfully


Record(s): 1

(None,)


Good Query execution



Evaluating sample: 11
Question: What is the number of news articles published per day in the United States and Canada, for the last 30 days?
SCHEMA: CREATE TABLE news_articles (id INT, title VARCHAR(50), publication_date DATE, country VARCHAR(50)); INSERT INTO news_articles (id, title, publication_date, country) VALUES (1, 'Article1', '2022-01-01', 'United States'), (2, 'Article2', '2022-01-02', 'Canada'), (3, 'Article3', '2022-01-03', 'United States'), (4, 'Article4', '2022-01-04', 'Canada');
Original Answer: SELECT DATE(publication_date) as date, COUNT(*) as num_articles FROM news_articles WHERE country IN ('United States', 'Canada') AND publication_date >= NOW() - INTERVAL 30 DAY GROUP BY date ORDER BY date DESC;
Generated Answer: SELECT COUNT(*) FROM news_articles WHERE country = 'United States' OR country = 'Canada' AND publication_date >= DATE_SUB(CURDATE(), INTERVAL 30 DAY)
Closest Distance: 0.2352416217327118


MATCH (Semantically Similar)


SCHEMA QUERY: CREATE TABLE news_articles (id INT, title VARCHAR(50), publication_date DATE, country VARCHAR(50)); INSERT INTO news_articles (id, title, publication_date, country) VALUES (1, 'Article1', '2022-01-01', 'United States'), (2, 'Article2', '2022-01-02', 'Canada'), (3, 'Article3', '2022-01-03', 'United States'), (4, 'Article4', '2022-01-04', 'Canada');
Table Created successfully


Similar Query: SELECT DATE(publication_date) as date, COUNT(*) as num_articles FROM news_articles WHERE country IN ('United States', 'Canada') AND publication_date >= NOW() - INTERVAL 30 DAY GROUP BY date ORDER BY date DESC;
Database connected successfully
Error executing query: syntax error at or near "30"
LINE 1: ...Canada') AND publication_date >= NOW() - INTERVAL 30 DAY GRO...
                                                             ^



Bad Query execution



Evaluating sample: 12
Question: What is the number of travel advisories issued for each month for each country?
SCHEMA: CREATE TABLE if not exists travel_advisory (advisory_id INT, country VARCHAR(50), issue_date DATE); INSERT INTO travel_advisory (advisory_id, country, issue_date) VALUES (1, 'France', '2022-02-01'), (2, 'Japan', '2022-03-01'), (3, 'Canada', '2022-01-01'), (4, 'Egypt', '2022-04-01'), (5, 'Australia', '2022-05-01');
Original Answer: SELECT EXTRACT(MONTH FROM issue_date) as month, country, COUNT(*) as num_advisories FROM travel_advisory GROUP BY month, country;
Generated Answer: SELECT COUNT(advisory_id), country FROM travel_advisory GROUP BY country, issue_date HAVING COUNT(*) = 1
Closest Distance: 0.5168290138244629


MATCH (Semantically Similar)


SCHEMA QUERY: CREATE TABLE if not exists travel_advisory (advisory_id INT, country VARCHAR(50), issue_date DATE); INSERT INTO travel_advisory (advisory_id, country, issue_date) VALUES (1, 'France', '2022-02-01'), (2, 'Japan', '2022-03-01'), (3, 'Canada', '2022-01-01'), (4, 'Egypt', '2022-04-01'), (5, 'Australia', '2022-05-01');
Table Created successfully


Similar Query: SELECT EXTRACT(MONTH FROM issue_date) as month, country, COUNT(*) as num_advisories FROM travel_advisory GROUP BY month, country;
Database connected successfully


Record(s): 5

(Decimal('2'), 'France', 1)
(Decimal('3'), 'Japan', 1)
(Decimal('4'), 'Egypt', 1)
(Decimal('1'), 'Canada', 1)
(Decimal('5'), 'Australia', 1)


Good Query execution



Evaluating sample: 13
Question: Delete the record with id 2 from the 'animals' table
SCHEMA: CREATE TABLE animals (id INT PRIMARY KEY, name VARCHAR(50), species VARCHAR(50), population INT);
Original Answer: DELETE FROM animals WHERE id = 2;
Generated Answer: DELETE FROM animals WHERE id = 2
Closest Distance: 0.04491596296429634


MATCH (Semantically Similar)


SCHEMA QUERY: CREATE TABLE animals (id INT PRIMARY KEY, name VARCHAR(50), species VARCHAR(50), population INT);
Table Created successfully


Similar Query: DELETE FROM animals WHERE id = 2;
Database connected successfully
Error executing query: no results to fetch


Bad Query execution



Evaluating sample: 14
Question: How many donors from each country have donated to causes with a focus on climate change?
SCHEMA: CREATE TABLE Donors (DonorID INT, DonorName VARCHAR(50), DonationAmount DECIMAL(10,2), CauseID INT, FirstDonationDate DATE, Country VARCHAR(50));CREATE TABLE Causes (CauseID INT, CauseName VARCHAR(50), Focus VARCHAR(50));
Original Answer: SELECT D.Country, COUNT(DISTINCT D.DonorID) FROM Donors D JOIN Causes C ON D.CauseID = C.CauseID WHERE C.Focus = 'climate change' GROUP BY D.Country;
Generated Answer: SELECT COUNT(*), DonorName, Country FROM Donors JOIN Causes ON Donors.CauseID = Causes.CauseID WHERE Causes.Focus = 'Climate change' GROUP BY DonorName, Country
Closest Distance: 0.07848970592021942


MATCH (Semantically Similar)


SCHEMA QUERY: CREATE TABLE Donors (DonorID INT, DonorName VARCHAR(50), DonationAmount DECIMAL(10,2), CauseID INT, FirstDonationDate DATE, Country VARCHAR(50));CREATE TABLE Causes (CauseID INT, CauseName VARCHAR(50), Focus VARCHAR(50));
Table Created successfully


Similar Query: SELECT D.Country, COUNT(DISTINCT D.DonorID) FROM Donors D JOIN Causes C ON D.CauseID = C.CauseID WHERE C.Focus = 'climate change' GROUP BY D.Country;